
puts 'Сколько вам лет'
age = gets.to_i
puts 'Являетесь ли вы членом партии Единая Россия? (y/n)'
answer = gets.chomp.downcase
if age >= 18 && answer == 'y'
    puts 'Access dinated'
end

puts 'Введите ваш логин и пароль '
puts 'Ваш логин: '
log_in = gets.chomp.downcase
puts 'Ваш пароль: '
pass = gets.to_i
if (log_in == 'admin' && pass == 12345)
    puts 'Доступ разрешен'

end

puts 'известно, что на Луне продают участки. Любой участок менее 50 квадратных
метров стоит 1000 долларов. Участок площадью от 50 до 100 квадратных метров стоит
1500 долларов. От 100 и выше - по 25 долларов за квадратный метр. Напишите
программу, которая запрашивает длину и ширину участка и выводит на экран его
стоимость.'
puts 'Продажа участков: выбирете размер участка'
place = gets.to_i
if place < 50
    puts "Данные участки стоят менее 1000 уе"
elsif place >= 50 && place <= 99
    puts "Участок площадью от 50 до 100 квадратных метров стоитs
    1500 долларов"
else (place == 100 || place > 100)
    puts "Данный участок стоит :  #{place * 25}  уе"

end

